id: /subscriptions/a92bfee7-ad40-4b5f-83cd-db3ca90504d8/resourceGroups/test/providers/Microsoft.OperationalInsights/workspaces/test-workspace/providers/Microsoft.SecurityInsights/alertRules/34e50bd0-6a6a-47e1-a509-7f5e0951445c
name: 34e50bd0-6a6a-47e1-a509-7f5e0951445c
type: Microsoft.SecurityInsights/alertRules
etag: '"eb04281c-0000-0100-0000-6876692c0000"'
kind: Scheduled
query: "DeviceImageLoadEvents \n| where FileName in~ (\"mscoree.dll\", \"mscorlib.dll\"\
  , \"mscorlib.ni.dll\") \n| where tolower(InitiatingProcessFileName) in (\"wscript.exe\"\
  , \"cscript.exe\", \"mshta.exe\")\n"
query_frequency: PT1H
query_period: PT1H
severity: Medium
trigger_operator: GreaterThan
trigger_threshold: 0
event_grouping_settings:
  aggregation_kind: SingleAlert
entity_mappings:
- entity_type: Account
  field_mappings:
  - identifier: Sid
    column_name: InitiatingProcessAccountSid
  - identifier: Name
    column_name: InitiatingProcessAccountName
  - identifier: NTDomain
    column_name: InitiatingProcessAccountDomain
- entity_type: Host
  field_mappings:
  - identifier: FullName
    column_name: DeviceName
- entity_type: Process
  field_mappings:
  - identifier: CommandLine
    column_name: InitiatingProcessCommandLine
alert_rule_template_name: 9f921513-65f3-48a2-ae7d-326c5901c55e
template_version: 1.0.0
description: |-
  This query detects .NET being loaded from wscript or cscript to run .NET code, such as cactustorch and sharpshooter.
  All based on the DotNetToJScript by James Foreshaw documented here https://github.com/tyranid/DotNetToJScript.
display_name: Detect .NET runtime being loaded in JScript for code execution
enabled: true
last_modified_utc: '2025-07-15T14:43:55.270274Z'
suppression_duration: PT1H
suppression_enabled: false
tactics:
- Execution
incident_configuration:
  create_incident: true
  grouping_configuration:
    enabled: false
    reopen_closed_incident: false
    lookback_duration: PT5H
    matching_method: AllEntities
    group_by_entities: []
    group_by_alert_details: []
    group_by_custom_details: []
