id: /subscriptions/a92bfee7-ad40-4b5f-83cd-db3ca90504d8/resourceGroups/test/providers/Microsoft.OperationalInsights/workspaces/test-workspace/providers/Microsoft.SecurityInsights/alertRules/f28284cc-e0e8-47d2-b892-02284ede8c52
name: f28284cc-e0e8-47d2-b892-02284ede8c52
type: Microsoft.SecurityInsights/alertRules
etag: '"eb04b01c-0000-0100-0000-6876692e0000"'
kind: Scheduled
query: "let ProcessCreationEvents=(union isfuzzy=true\n(SecurityEvent\n| where EventID==4688\n\
  | where isnotempty(CommandLine)\n| project TimeGenerated, Computer, Account = SubjectUserName,\
  \ AccountDomain = SubjectDomainName, FileName = Process, CommandLine, ParentProcessName\n\
  ),\n(WindowsEvent\n| where EventID==4688\n| where EventData has_any (\".decode('base64')\"\
  , \"base64 --decode\", \".decode64(\" )\n| extend CommandLine = tostring(EventData.CommandLine)\n\
  | where isnotempty(CommandLine)\n| extend SubjectUserName = tostring(EventData.SubjectUserName)\n\
  | extend SubjectDomainName = tostring(EventData.SubjectDomainName)\n| extend NewProcessName\
  \ = tostring(EventData.NewProcessName)\n| extend FileName=tostring(split(NewProcessName,\
  \ '\\\\')[-1])\n| extend ParentProcessName = tostring(EventData.ParentProcessName)\n\
  | project TimeGenerated, Computer, Account = SubjectUserName, AccountDomain = SubjectDomainName,\
  \ CommandLine, ParentProcessName\n));\nProcessCreationEvents \n| where CommandLine\
  \ contains \".decode('base64')\"\n        or CommandLine contains \"base64 --decode\"\
  \n        or CommandLine contains \".decode64(\" \n| summarize StartTimeUtc = min(TimeGenerated),\
  \ EndTimeUtc = max(TimeGenerated), CountToday = count() by Computer, Account, AccountDomain,\
  \ FileName, CommandLine, ParentProcessName\n| extend HostName = iif(Computer has\
  \ '.',substring(Computer,0,indexof(Computer,'.')),Computer) , DnsDomain = iif(Computer\
  \ has '.',substring(Computer,indexof(Computer,'.')+1),'')\n"
query_frequency: P1D
query_period: P1D
severity: Medium
trigger_operator: GreaterThan
trigger_threshold: 0
event_grouping_settings:
  aggregation_kind: SingleAlert
entity_mappings:
- entity_type: Account
  field_mappings:
  - identifier: Name
    column_name: Account
- entity_type: Host
  field_mappings:
  - identifier: FullName
    column_name: Computer
  - identifier: HostName
    column_name: HostName
  - identifier: DnsDomain
    column_name: DnsDomain
alert_rule_template_name: d6190dde-8fd2-456a-ac5b-0a32400b0464
template_version: 1.1.3
description: "Encoding malicious software is a technique used to obfuscate files from\
  \ detection. \nThe first CommandLine component is looking for Python decoding base64.\
  \ \nThe second CommandLine component is looking for Bash/sh command line base64\
  \ decoding.\nThe third one is looking for Ruby decoding base64."
display_name: Process executed from binary hidden in Base64 encoded file
enabled: true
last_modified_utc: '2025-07-15T14:43:55.228676Z'
suppression_duration: PT1H
suppression_enabled: false
tactics:
- Execution
- DefenseEvasion
incident_configuration:
  create_incident: true
  grouping_configuration:
    enabled: false
    reopen_closed_incident: false
    lookback_duration: PT5H
    matching_method: AllEntities
    group_by_entities: []
    group_by_alert_details: []
    group_by_custom_details: []
