id: /subscriptions/a92bfee7-ad40-4b5f-83cd-db3ca90504d8/resourceGroups/test/providers/Microsoft.OperationalInsights/workspaces/test-workspace/providers/Microsoft.SecurityInsights/alertRules/7bdec531-4e3c-4964-89c1-7f311c1d26db
name: 7bdec531-4e3c-4964-89c1-7f311c1d26db
type: Microsoft.SecurityInsights/alertRules
etag: '"eb04ae1c-0000-0100-0000-6876692e0000"'
kind: Scheduled
query: |
  let procList = externaldata(Process:string) [@"https://raw.githubusercontent.com/Azure/Azure-Sentinel/master/Sample%20Data/Microsoft_Lolbas_Execution_Binaries.csv"] with (format="csv", ignoreFirstRecord=True);
  SecurityEvent
  | where EventID == 4688 and Process has_any (procList) and not (NewProcessName has ("C:\\Windows\\"))
  | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by EventID, Computer, SubjectUserName, NewProcessName, Process, CommandLine
  | extend Name=tostring(split(SubjectUserName, "@")[0]), UPNSuffix=tostring(split(SubjectUserName, "@")[1])
  | extend HostName = iif(Computer has '.',substring(Computer,0,indexof(Computer,'.')),Computer) , DnsDomain = iif(Computer has '.',substring(Computer,indexof(Computer,'.')+1),'')
query_frequency: PT1H
query_period: PT1H
severity: Medium
trigger_operator: GreaterThan
trigger_threshold: 0
event_grouping_settings:
  aggregation_kind: SingleAlert
entity_mappings:
- entity_type: Account
  field_mappings:
  - identifier: Name
    column_name: Name
  - identifier: UPNSuffix
    column_name: UPNSuffix
- entity_type: Host
  field_mappings:
  - identifier: FullName
    column_name: Computer
  - identifier: HostName
    column_name: HostName
  - identifier: DnsDomain
    column_name: DnsDomain
- entity_type: Process
  field_mappings:
  - identifier: CommandLine
    column_name: CommandLine
alert_rule_template_name: 15049017-527f-4d3b-b011-b0e99e68ef45
template_version: 1.0.4
description: "The query detects Windows binaries, that can be executed from a non-default\
  \ directory (e.g. C:\\Windows\\, C:\\Windows\\System32 etc.). \nRef: https://lolbas-project.github.io/"
display_name: Windows Binaries Executed from Non-Default Directory
enabled: true
last_modified_utc: '2025-07-15T14:43:55.244219Z'
suppression_duration: PT1H
suppression_enabled: false
tactics:
- Execution
incident_configuration:
  create_incident: true
  grouping_configuration:
    enabled: false
    reopen_closed_incident: false
    lookback_duration: PT5H
    matching_method: AllEntities
    group_by_entities: []
    group_by_alert_details: []
    group_by_custom_details: []
